---
type: MEPNetworkSegmentId
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 7
tags: [revit-api, class]
---

# MEPNetworkSegmentId

`Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | MEPNetworkSegmentId | — | `` |
| Constructor | MEPNetworkSegmentId | 2024 | `public MEPNetworkSegmentId ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsValid | 2024 | `public bool IsValid ()` |
| Property | ElementId | 2024 | `public ElementId ElementId { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SegmentId | 2024 | `public int SegmentId { get ; set ; }` |